tsung/simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="password-deploy.tnmgpgntik.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
  </load>

  
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>


  <sessions>
    <session name="create_account" probability="100" type="ts_http">
      <!-- Request home page -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <thinktime value="2" random="true"></thinktime>

      <!-- Request sign up page, get authenticity_token -->
      <request subst="true">
        <dyn_variable name="authenticity_token" re='name="authenticity_token" value="(.*)"'></dyn_variable>
        <http url="/users/sign_up" version="1.1" method="GET"></http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <!-- Generate random username -->
      <setdynvars sourcetype="random_string" length="10">
        <var name="username" />
      </setdynvars>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
        {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
        edoc_lib:escape_uri(binary_to_list(Val)) end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <!-- Create account -->
      <request subst="true">
        <http 
          url='/users'
          version='1.1'
          method='POST'
          contents='authenticity_token=%%_escaped_authenticity_token%%&amp;user%5Bemail%5D=%%_username%%%40hostname&amp;user%5Bpassword%5D=foobar&amp;user%5Bpassword_confirmation%5D=foobar&amp;commit=Sign+up'                                        
          content_type="application/x-www-form-urlencoded"/>
      </request>
                
      <thinktime value="2"></thinktime>


<setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
  io:format([126, $p, 126, $n, 126, $n], [DynVars]),
  ok end.">
  <var name="dump" />
</setdynvars>


    </session>
  </sessions>
</tsung>